tap 'aspnet/dnx'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'goles/battery'
tap 'homebrew/binary'
tap 'homebrew/bundle'
tap 'thoughtbot/formulae'
tap 'yudai/gotty'
brew 'android-platform-tools'
brew 'libyaml'
brew 'openssl'
brew 'ansible'
brew 'xz'
brew 'pkg-config'
brew 'gettext'
brew 'libffi'
brew 'glib'
brew 'pcre'
brew 'git'
brew 'gobject-introspection'
brew 'atk'
brew 'autoconf'
brew 'automake'
brew 'icu4c'
brew 'boost'
brew 'go'
brew 'docker'
brew 'boot2docker'
brew 'c-ares'
brew 'ghc'
brew 'cabal-install'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'pixman'
brew 'cairo'
brew 'clib'
brew 'ctags'
brew 'd-bus'
brew 'elasticsearch'
brew 'libtool'
brew 'unixodbc'
brew 'jpeg'
brew 'libtiff'
brew 'wxmac'
brew 'erlang'
brew 'elixir'
brew 'fpp'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'geoip'
brew 'git-flow'
brew 'gmp'
brew 'gnupg'
brew 'libtasn1'
brew 'nettle'
brew 'gnutls'
brew 'harfbuzz'
brew 'pango'
brew 'graphviz'
brew 'gsettings-desktop-schemas'
brew 'hicolor-icon-theme'
brew 'gtk+'
brew 'libepoxy'
brew 'gtk+3'
brew 'readline'
brew 'sqlite'
brew 'python'
brew 'pygobject'
brew 'py2cairo'
brew 'pygtk'
brew 'gtk-mac-integration'
brew 'gtksourceview'
brew 'httpie'
brew 'hub'
brew 'mercurial'
brew 'hugo'
brew 'libevent'
brew 'libewf'
brew 'libgpg-error'
brew 'libgcrypt'
brew 'libksba'
brew 'libmagic'
brew 'libsass'
brew 'lua'
brew 'lua51'
brew 'mongodb'
brew 'mono'
brew 'mysql'
brew 'nmap'
brew 'node'
brew 'nsq'
brew 'p7zip'
brew 'postgresql'
brew 'pstree'
brew 'pygtksourceview'
brew 'rabbitmq'
brew 'radare2'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'rethinkdb'
brew 'ruby'
brew 'ruby-build'
brew 'sassc'
brew 'scala'
brew 'spark'
brew 'the_silver_searcher'
brew 'thefuck'
brew 'thrift'
brew 'tmux'
brew 'tree'
brew 'vim', args: ['with-lua']
brew 'wget'
brew 'wireshark'
brew 'youtube-dl'
brew 'z'
brew 'aspnet/dnx/dnvm'
brew 'caskroom/cask/brew-cask'
brew 'thoughtbot/formulae/rcm'
brew 'yudai/gotty/gotty'
cask 'consul'
cask 'consul-template'
cask 'consul-web-ui'
cask 'dash'
cask 'evernote'
cask 'font-bree-serif'
cask 'font-fontawesome'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-sans-pro'
cask 'font-sue-ellen-francisco'
cask 'font-ubuntu-mono-powerline'
cask 'ifunbox'
cask 'orelord-mongodb'
cask 'robomongo'
cask 'skitch'
cask 'skype'
cask 'teamviewer'
cask 'utorrent'
cask 'vlc'
cask 'xtrafinder'
