tap 'aspnet/dnx'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'd12frosted/emacs-plus'
tap 'facebook/fb'
tap 'goles/battery'
tap 'homebrew/binary'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/versions'
tap 'neovim/neovim'
tap 'railwaycat/emacsmacport'
tap 'thoughtbot/formulae'
tap 'yudai/gotty'
brew 'android-platform-tools'
brew 'libyaml'
brew 'openssl@1.1'
brew 'gdbm'
brew 'openssl'
brew 'readline'
brew 'sqlite'
brew 'python'
brew 'ansible'
brew 'ant'
brew 'clasp'
brew 'gringo'
brew 'aspcud'
brew 'aspell'
brew 'gettext'
brew 'libffi'
brew 'pcre'
brew 'glib'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'pixman'
brew 'cairo'
brew 'git'
brew 'pkg-config'
brew 'gobject-introspection'
brew 'atk'
brew 'libxml2'
brew 'augeas'
brew 'autoconf'
brew 'automake'
brew 'bash-completion'
brew 'bdw-gc'
brew 'bfg'
brew 'blueutil'
brew 'boost'
brew 'c-ares'
brew 'ghc'
brew 'cabal-install'
brew 'ocaml'
brew 'ocamlbuild'
brew 'camlp4'
brew 'carthage'
brew 'dialog'
brew 'certbot'
brew 'clib'
brew 'cmake'
brew 'consul'
brew 'coreutils'
brew 'gmp'
brew 'libevent'
brew 'llvm'
brew 'crystal-lang'
brew 'ctags'
brew 'zeromq'
brew 'czmq'
brew 'dbus'
brew 'libgpg-error'
brew 'libassuan'
brew 'libgcrypt'
brew 'libksba'
brew 'pth'
brew 'dirmngr'
brew 'dlite'
brew 'dos2unix'
brew 'doxygen'
brew 'elasticsearch'
brew 'jpeg'
brew 'libtiff'
brew 'wxmac'
brew 'erlang'
brew 'elixir'
brew 'elm'
brew 'emacs'
brew 'fasd'
brew 'lame'
brew 'x264'
brew 'xvid'
brew 'ffmpeg'
brew 'flatbuffers'
brew 'flow'
brew 'libtool'
brew 'icu4c'
brew 'harfbuzz'
brew 'pango'
brew 'fontforge'
brew 'fpp'
brew 'fswatch'
brew 'fuzzy-find'
brew 'mpfr'
brew 'gawk'
brew 'shared-mime-info'
brew 'gdk-pixbuf'
brew 'geoip'
brew 'git-extras'
brew 'git-flow'
brew 'gitup'
brew 'go'
brew 'glide'
brew 'gnu-getopt'
brew 'gnu-sed', args: ['with-default-names']
brew 'gnupg'
brew 'pinentry'
brew 'gpg-agent'
brew 'libusb'
brew 'libusb-compat'
brew 'gnupg2'
brew 'libtasn1'
brew 'nettle'
brew 'gnutls'
brew 'godep'
brew 'gradle'
brew 'graphviz'
brew 'gsettings-desktop-schemas'
brew 'hicolor-icon-theme'
brew 'gtk+'
brew 'libepoxy'
brew 'gtk+3'
brew 'py2cairo'
brew 'pygobject'
brew 'pygtk'
brew 'gtk-mac-integration'
brew 'gtksourceview'
brew 'heroku'
brew 'htop-osx'
brew 'xz'
brew 'python3'
brew 'httpie'
brew 'hub'
brew 'hugo'
brew 'imagemagick'
brew 'intltool'
brew 'jemalloc'
brew 'oniguruma'
brew 'jq'
brew 'libatomic_ops'
brew 'libcroco'
brew 'libev'
brew 'libewf'
brew 'libplist'
brew 'usbmuxd'
brew 'libimobiledevice'
brew 'libmagic'
brew 'libmpdclient'
brew 'libpcl'
brew 'librsvg'
brew 'libsass'
brew 'libsodium'
brew 'libssh'
brew 'libssh2'
brew 'libtermkey'
brew 'libuv'
brew 'libvo-aacenc'
brew 'libvterm'
brew 'lua'
brew 'lua51'
brew 'makedepend'
brew 'md5sha1sum'
brew 'mercurial'
brew 'mongodb'
brew 'mono'
brew 'mpc'
brew 'msgpack'
brew 'nmap'
brew 'node'
brew 'opam'
brew 'p7zip'
brew 'pandoc'
brew 'pwgen'
brew 'tree'
brew 'pass'
brew 'postgresql'
brew 'protobuf'
brew 'pstree'
brew 'pygtksourceview'
brew 'rabbitmq'
brew 'ruby-build'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'remind'
brew 'scala'
brew 'scons'
brew 'sphinx-doc'
brew 'swig'
brew 'terraform'
brew 'texi2html'
brew 'the_silver_searcher'
brew 'tmux'
brew 'todo-txt'
brew 'trash'
brew 'unibilium'
brew 'unixodbc'
brew 'utf8proc'
brew 'vala'
brew 'valabind'
brew 'vault'
brew 'vim', args: ['with-lua']
brew 'watchman'
brew 'wemux'
brew 'wget'
brew 'x11vnc'
brew 'xcproj'
brew 'xhyve'
brew 'yarn'
brew 'yasm'
brew 'youtube-dl'
brew 'z'
brew 'zsh'
brew 'aspnet/dnx/dnvm'
brew 'd12frosted/emacs-plus/emacs-plus', args: ['with-cocoa', 'with-gnutls', 'with-imagemagick', 'with-spacemacs-icon']
brew 'facebook/fb/buck'
brew 'homebrew/versions/rebar3'
brew 'neovim/neovim/neovim'
brew 'thoughtbot/formulae/liftoff'
cask '1password'
cask 'atom'
cask 'bit-slicer'
cask 'ckb'
cask 'disk-inventory-x'
cask 'docker'
cask 'flux'
cask 'font-source-code-pro'
cask 'google-chrome'
cask 'imageoptim'
cask 'licecap'
cask 'skim'
cask 'skype'
