tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'd12frosted/emacs-plus'
tap 'facebook/fb'
tap 'goles/battery'
tap 'homebrew/binary'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'neovim/neovim'
tap 'railwaycat/emacsmacport'
tap 'thoughtbot/formulae'
tap 'yudai/gotty'
cask 'java'
cask 'xquartz'
brew 'android-platform-tools'
brew 'pkg-config'
brew 'libyaml'
brew 'makedepend'
brew 'openssl'
brew 'ansible'
brew 'ant'
brew 'cmake'
brew 'xz'
brew 'pcre'
brew 'gettext'
brew 'git'
brew 'go'
brew 'aspell'
brew 'libffi'
brew 'glib'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'pixman'
brew 'cairo'
brew 'gobject-introspection'
brew 'atk'
brew 'autoconf'
brew 'automake'
brew 'bash-completion'
brew 'bdw-gc'
brew 'blueutil'
brew 'icu4c'
brew 'boost'
brew 'docker'
brew 'boot2docker'
brew 'c-ares'
brew 'ghc'
brew 'cabal-install'
brew 'carthage'
brew 'clib'
brew 'gmp'
brew 'coreutils'
brew 'libevent'
brew 'harfbuzz'
brew 'pango'
brew 'jpeg'
brew 'libtiff'
brew 'gdk-pixbuf'
brew 'intltool'
brew 'libcroco'
brew 'libtool'
brew 'libepoxy'
brew 'hicolor-icon-theme'
brew 'gsettings-desktop-schemas'
brew 'gtk+3'
brew 'librsvg'
brew 'graphviz'
brew 'readline'
brew 'sqlite'
brew 'gdbm'
brew 'python'
brew 'llvm'
brew 'crystal-lang'
brew 'ctags'
brew 'libsodium'
brew 'zeromq'
brew 'czmq'
brew 'dbus'
brew 'dlite'
brew 'docker-machine'
brew 'docker-compose'
brew 'docker-machine-driver-xhyve'
brew 'dos2unix'
brew 'elasticsearch'
brew 'wxmac'
brew 'erlang'
brew 'elixir'
brew 'elm'
brew 'libtasn1'
brew 'nettle'
brew 'gnutls'
brew 'imagemagick'
brew 'emacs'
brew 'fasd'
brew 'x264'
brew 'lame'
brew 'xvid'
brew 'libssh'
brew 'ffmpeg'
brew 'flatbuffers'
brew 'flow'
brew 'fontforge'
brew 'fpp'
brew 'fswatch'
brew 'fuzzy-find'
brew 'geoip'
brew 'git-extras'
brew 'git-flow'
brew 'gitup'
brew 'glide'
brew 'gnu-getopt'
brew 'gnu-sed', args: ['with-default-names']
brew 'gnupg'
brew 'godep'
brew 'gtk+'
brew 'pygobject'
brew 'py2cairo'
brew 'pygtk'
brew 'gtk-mac-integration'
brew 'gtksourceview'
brew 'heroku'
brew 'htop-osx'
brew 'python3'
brew 'httpie'
brew 'hub'
brew 'hugo'
brew 'oniguruma'
brew 'jq'
brew 'libewf'
brew 'libgpg-error'
brew 'libgcrypt'
brew 'libksba'
brew 'libmagic'
brew 'libmpdclient'
brew 'libpcl'
brew 'libsass'
brew 'libssh2'
brew 'libvo-aacenc'
brew 'lua'
brew 'lua51'
brew 'mercurial'
brew 'scons'
brew 'mongodb'
brew 'mono'
brew 'mpc'
brew 'msgpack'
brew 'nmap'
brew 'node'
brew 'p7zip'
brew 'pandoc'
brew 'pwgen'
brew 'tree'
brew 'pass'
brew 'postgresql'
brew 'pstree'
brew 'pygtksourceview'
brew 'rabbitmq'
brew 'swig'
brew 'vala'
brew 'valabind'
brew 'yara'
brew 'radare2'
brew 'ruby-build'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'remind'
brew 'swiftlint'
brew 'the_silver_searcher'
brew 'tmux'
brew 'todo-txt'
brew 'trash'
brew 'unixodbc'
brew 'vim', args: ['with-lua']
brew 'watchman'
brew 'wemux'
brew 'wget'
brew 'x11vnc'
brew 'xcproj'
brew 'xhyve'
brew 'youtube-dl'
brew 'z'
brew 'zsh'
brew 'aspnet/dnx/dnvm'
brew 'd12frosted/emacs-plus/emacs-plus', args: ['with-cocoa', 'with-gnutls', 'with-imagemagick', 'with-librsvg', 'with-spacemacs-icon']
brew 'facebook/fb/buck'
brew 'neovim/neovim/neovim'
brew 'thoughtbot/formulae/liftoff'
cask '1password'
cask 'android-file-transfer'
cask 'android-studio'
cask 'bit-slicer'
cask 'dash'
cask 'easysimbl'
cask 'fabric'
cask 'flux'
cask 'font-fira-sans'
cask 'font-fontawesome'
cask 'font-hack'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'geektool'
cask 'genymotion'
cask 'google-chrome'
cask 'keycastr'
cask 'kitematic'
cask 'ksdiff'
cask 'licecap'
cask 'skim'
cask 'skitch'
cask 'skype'
cask 'steam'
cask 'teamviewer'
cask 'unrarx'
cask 'utorrent'
cask 'virtualbox'
cask 'vlc'
