anthropic.claude-code
azemoh.one-monokai
davidanson.vscode-markdownlint
github.codespaces
github.vscode-github-actions
golang.go
jakebecker.elixir-ls
jetpack-io.devbox
kleber-swf.ocean-dark-extended
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.makefile-tools
ms-vscode.remote-explorer
openai.chatgpt
openai.openai-chatgpt-adhoc
pgourlain.erlang
shopify.ruby-lsp
